In [1]:
# load the libraries
import pandas as pd

# domestic_visitors

In [2]:
df1 = pd.read_csv('domestic_visitors_2016.csv')
df2 = pd.read_csv('domestic_visitors_2017.csv')
df3 = pd.read_csv('domestic_visitors_2018.csv')
df4 = pd.read_csv('domestic_visitors_2019.csv')

In [3]:
df1.head(1)

   district        date    month  year visitors
0  Adilabad  01-01-2016  January  2016   792136

In [4]:
df2.head(1)

   district        date    month  year visitors
0  Adilabad  01-01-2017  January  2017   318799

In [5]:
df3.head(1)

   district        date    month  year visitors
0  Adilabad  01-01-2018  January  2018   320356

In [6]:
df4.head(1)

   district        date    month  year visitors
0  Adilabad  01-01-2019  January  2019    25071

In [7]:
# Combining the datasets

In [8]:
combined_df_domestic = pd.concat([df1, df2, df3, df4], axis=0)

In [9]:
combined_df_domestic.to_csv('domestic_visitors.csv', index=False)

In [10]:
domestic_visitors = pd.read_csv('domestic_visitors.csv')

In [11]:
domestic_visitors

             district        date      month  year visitors
0            Adilabad  01-01-2016    January  2016   792136
1            Adilabad  01-02-2016   February  2016   937820
2            Adilabad  01-03-2016      March  2016   582946
3            Adilabad  01-04-2016      April  2016   341948
4            Adilabad  01-05-2016        May  2016   252887
...               ...         ...        ...   ...      ...
1507  Yadadri Bhongir  01-08-2019     August  2019   389010
1508  Yadadri Bhongir  01-09-2019  September  2019   366862
1509  Yadadri Bhongir  01-10-2019    October  2019   381860
1510  Yadadri Bhongir  01-11-2019   November  2019   365990
1511  Yadadri Bhongir  01-12-2019   December  2019   477635

[1512 rows x 5 columns]

# Foreign_visitors

In [12]:
fv1 = pd.read_csv('foreign_visitors_2016.csv')
fv2 = pd.read_csv('foreign_visitors_2017.csv')
fv3 = pd.read_csv('foreign_visitors_2018.csv')
fv4 = pd.read_csv('foreign_visitors_2019.csv')

In [13]:
fv1.head(1)

   district        date    month  year visitors
0  Adilabad  01-01-2016  January  2016        2

In [14]:
fv2.head(1)

   district        date    month  year visitors
0  Adilabad  01-01-2017  January  2017        5

In [15]:
fv3.head(1)

   district        date    month  year visitors
0  Adilabad  01-01-2018  January  2018        0

In [16]:
fv4.head(1)

   district        date    month  year visitors
0  Adilabad  01-01-2019  January  2019        0

In [17]:
combined_vf_foreign = pd.concat([fv1, fv2, fv3, fv4], axis=0)

In [18]:
combined_vf_foreign.to_csv('foreign_visitors.csv', index=False)

In [19]:
cv = pd.read_csv('foreign_visitors.csv')

In [20]:
cv

             district        date      month  year visitors
0            Adilabad  01-01-2016    January  2016        2
1            Adilabad  01-02-2016   February  2016        0
2            Adilabad  01-03-2016      March  2016        2
3            Adilabad  01-04-2016      April  2016        0
4            Adilabad  01-05-2016        May  2016        0
...               ...         ...        ...   ...      ...
1507  Yadadri Bhongir  01-08-2019     August  2019        0
1508  Yadadri Bhongir  01-09-2019  September  2019        0
1509  Yadadri Bhongir  01-10-2019    October  2019        0
1510  Yadadri Bhongir  01-11-2019   November  2019        0
1511  Yadadri Bhongir  01-12-2019   December  2019        0

[1512 rows x 5 columns]